import React from 'react';

import '../assets/css/footer.css';


function Footer() {
    return (
        <footer className="footer">
            <div className="lists-container">
                <ul className="ul">
                    <li className="li" key="About">О проекте</li>
                    <li className="li" key="Contacts">Контакты</li>
                    <li className="li" key="User_agreement">Пользовательское соглашение</li>
                    <li className="li" key="Privacy_policy">Политика конфиденциальности</li>
                    <li className="li" key="Recommendation_technologies">Рекомендательные технологии</li>
                </ul>
                <ul className="ul">
                    <li className="li" key="Support">Служба поддержки</li>
                    <li className="li" key="FAQ">Часто задаваемые вопросы</li>
                    <li className="li" key="User_agreement">Личный помощник NovelGPT</li>
                </ul>
                <ul className="ul">
                    <li className="li" key="Bestsellers">Бестселлеры</li>
                    <li className="li" key="New">Новинки</li>
                    <li className="li" key="Recommendations">Рекомендации</li>
                </ul>
                <div>
                    <p className="p">NovelNook</p>
                    <p className="p"
                       style={{'margin-top': '6px', 'font-weight': '500', 'line-height': '220%'}}>Позволяет
                        пользователям беплатно читать свои
                        любимые книги и получать рекомендации.</p>
                    <div className="contacts">
                        <a href="https://github.com/daniilprg">
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M20 0C8.955 0 0 9.09522 0 20.3132C0 29.8316 6.45333 37.796 15.1533 40C15.06 39.7258 15 39.4075 15 39.0131V35.5413C14.1883 35.5413 12.8283 35.5413 12.4867 35.5413C11.1183 35.5413 9.90167 34.9437 9.31167 33.8333C8.65667 32.5992 8.54333 30.7118 6.92 29.5573C6.43833 29.1731 6.805 28.7347 7.36 28.7939C8.385 29.0884 9.235 29.8028 10.035 30.8625C10.8317 31.9238 11.2067 32.1642 12.695 32.1642C13.4167 32.1642 14.4967 32.1219 15.5133 31.9594C16.06 30.5493 17.005 29.251 18.16 28.6382C11.5 27.9424 8.32167 24.5772 8.32167 20.0085C8.32167 18.0415 9.14667 16.1388 10.5483 14.5358C10.0883 12.9446 9.51 9.69953 10.725 8.46382C13.7217 8.46382 15.5333 10.4376 15.9683 10.9708C17.4617 10.4511 19.1017 10.1566 20.825 10.1566C22.5517 10.1566 24.1983 10.4511 25.695 10.9742C26.125 10.4444 27.9383 8.46382 30.9417 8.46382C32.1617 9.70123 31.5767 12.9598 31.1117 14.5476C32.505 16.1473 33.325 18.0449 33.325 20.0085C33.325 24.5738 30.1517 27.9374 23.5017 28.6365C25.3317 29.6064 26.6667 32.3318 26.6667 34.3851V39.0131C26.6667 39.1892 26.6283 39.3161 26.6083 39.4668C34.4017 36.6923 40 29.1765 40 20.3132C40 9.09522 31.045 0 20 0Z"
                                    fill="#594C91" fill-opacity="0.25"/>
                            </svg>
                        </a>
                        <a href="https://t.me/daniilprg">
                            <svg style={{'margin-left': '20px'}} height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M20 0C31.0461 0 40 8.95391 40 20C40 31.0461 31.0461 40 20 40C8.95391 40 0 31.0461 0 20C0 8.95391 8.95391 0 20 0ZM26.8991 28.1522C27.267 27.0235 28.9904 15.7748 29.2035 13.5583C29.2678 12.887 29.0557 12.4409 28.64 12.2417C28.1374 12 27.393 12.1209 26.5296 12.4322C25.3452 12.8591 10.2043 19.2878 9.32956 19.66C8.5 20.0122 7.71565 20.3965 7.71565 20.953C7.71565 21.3443 7.94783 21.5643 8.58783 21.793C9.25391 22.0304 10.9313 22.5391 11.9217 22.8122C12.8757 23.0757 13.9617 22.847 14.5704 22.4687C15.2157 22.0678 22.6617 17.0852 23.1965 16.6487C23.7304 16.2122 24.1565 16.7713 23.72 17.2087C23.2835 17.6452 18.1722 22.6061 17.4983 23.293C16.68 24.127 17.2609 24.9913 17.8096 25.3374C18.4365 25.7322 22.9452 28.7565 23.6243 29.2417C24.3035 29.727 24.9922 29.947 25.6226 29.947C26.253 29.947 26.5852 29.1165 26.8991 28.1522Z"
                                    fill="#594C91" fill-opacity="0.25"/>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
            <p className="copyright">© 2024 NovelNook. Все права защищены.</p>
        </footer>
    );
}

export default Footer;
